![img](./temp/img.png)

In [2]:
import pandas as pd

In [3]:
# 리스트로부터 시리즈 생성
s = pd.Series([10, 20, 30, 40, 50, 60])
print(s)

# 인덱스와 함께 시리즈 생성
s = pd.Series([10, 20, 30, 40, 50, 60], index=['a', 'b', 'c', 'd', 'e', 'f'])
print(s)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64
a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [4]:
# 리스트로 데이터프레임 생성
data = {'이름': ['홍길동', '이순신', '강감찬'],
        '나이': [50, 40, 30],
        '직책': ['부장', '차장', '과장']}

In [5]:
df = pd.DataFrame(data)
print(df)

    이름  나이  직책
0  홍길동  50  부장
1  이순신  40  차장
2  강감찬  30  과장

In [6]:
#엑셀 파일 읽기 
# pip install openpyxl
df = pd.read_excel('./temp/demo.xlsx', 'Sheet1')
print(df)

     사번 성별  나이  판매금액   수입
0  E001  M  34   123  350
1  E002  F  40   114  450
2  E003  F  37   135  169
3  E004  M  30   139  189
4  E005  F  44   117  183
5  E006  M  36   121   90
6  E007  M  32   133  166
7  E008  F  26   140  120
8  E009  M  32   133   75
9  E010  M  36   133   40

In [7]:
df.head()  # 처음 5개의 행을 보여줌

     사번 성별  나이  판매금액   수입
0  E001  M  34   123  350
1  E002  F  40   114  450
2  E003  F  37   135  169
3  E004  M  30   139  189
4  E005  F  44   117  183

In [8]:
df.tail()  # 마지막 5개의 행을 보여줌

     사번 성별  나이  판매금액   수입
5  E006  M  36   121   90
6  E007  M  32   133  166
7  E008  F  26   140  120
8  E009  M  32   133   75
9  E010  M  36   133   40

In [9]:
df.info()  # 데이터프레임의 기본 정보 표시

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사번      10 non-null     object
 1   성별      10 non-null     object
 2   나이      10 non-null     int64
 3   판매금액    10 non-null     int64
 4   수입      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 528.0+ bytes

In [10]:
df.describe()  # 데이터 통계 요약 표시

              나이        판매금액          수입
count  10.000000   10.000000   10.000000
mean   34.700000  128.800000  183.200000
std     5.121849    9.271222  126.679648
min    26.000000  114.000000   40.000000
25%    32.000000  121.500000   97.500000
50%    35.000000  133.000000  167.500000
75%    36.750000  134.500000  187.500000
max    44.000000  140.000000  450.000000

In [11]:
df.groupby('성별')['수입'].mean()  # 성별로 그룹해서 수입의 평균 계산

성별
F    230.500000
M    151.666667
Name: 수입, dtype: float64

In [12]:
df['사번']  # 사번 열 선택

0    E001
1    E002
2    E003
3    E004
4    E005
5    E006
6    E007
7    E008
8    E009
9    E010
Name: 사번, dtype: object

In [13]:
df[['사번', '수입']]  # 사번과 수입 열 선택

     사번   수입
0  E001  350
1  E002  450
2  E003  169
3  E004  189
4  E005  183
5  E006   90
6  E007  166
7  E008  120
8  E009   75
9  E010   40

In [14]:
df.loc[1]  # 인덱스 1에 해당하는 행 선택

사번      E002
성별         F
나이        40
판매금액     114
수입       450
Name: 1, dtype: object

In [15]:
df.iloc[2]  # 두 번째 행 선택

사번      E003
성별         F
나이        37
판매금액     135
수입       169
Name: 2, dtype: object

In [16]:
df[df['성별'] == 'F']  # 성별이 F인 행 선택

     사번 성별  나이  판매금액   수입
1  E002  F  40   114  450
2  E003  F  37   135  169
4  E005  F  44   117  183
7  E008  F  26   140  120

In [17]:
df[df['수입'] > 100]  # 수입이 100보다 큰 행 선택

     사번 성별  나이  판매금액   수입
0  E001  M  34   123  350
1  E002  F  40   114  450
2  E003  F  37   135  169
3  E004  M  30   139  189
4  E005  F  44   117  183
6  E007  M  32   133  166
7  E008  F  26   140  120

In [18]:
df = pd.DataFrame(data)
print(df)

    이름  나이  직책
0  홍길동  50  부장
1  이순신  40  차장
2  강감찬  30  과장

In [19]:
df['성별'] = ['남성', '남성', '남성']  # '성별' 열 추가
print(df)

    이름  나이  직책  성별
0  홍길동  50  부장  남성
1  이순신  40  차장  남성
2  강감찬  30  과장  남성

In [20]:
df = df.drop('성별', axis=1)  # 성별 열 삭제
print(df)

    이름  나이  직책
0  홍길동  50  부장
1  이순신  40  차장
2  강감찬  30  과장